Masmiseim36/nxpSDK/boards/frdmke17z/bootloader_examples/flashloader/pin_mux.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MKE17Z256xxx7
package_id: MKE17Z256VLL7
mcu_data: ksdk2_0
processor_version: 0.10.1
pin_labels:
- {pin_num: '17', pin_signal: PTE14/FTM0_FLT1/TRGMUX_OUT4, label: SW3, identifier: SW3}
- {pin_num: '72', pin_signal: TSI1_CH5/PTA3/LPI2C0_SCL/EWM_IN/LPUART0_TX, label: SCL, identifier: SCL}
- {pin_num: '73', pin_signal: TSI1_CH4/PTA2/LPI2C0_SDA/EWM_OUT_b/LPUART0_RX, label: SDA, identifier: SDA}
- {pin_num: '54', pin_signal: TSI1_CH15/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3, label: RX, identifier: RX}
- {pin_num: '53', pin_signal: TSI1_CH16/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0, label: TX, identifier: TX}
- {pin_num: '48', pin_signal: TSI1_CH17/PTB2/FTM1_CH0/LPSPI0_SCK/TRGMUX_IN3, label: SCK, identifier: SCK}
- {pin_num: '47', pin_signal: TSI1_CH18/PTB3/FTM1_CH1/LPSPI0_SIN/TRGMUX_IN2, label: SIN, identifier: SIN}
- {pin_num: '28', pin_signal: ADC0_SE5/TSI0_CH24/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1, label: SOUT, identifier: SOUT}
- {pin_num: '27', pin_signal: ADC0_SE3/TSI0_CH23/PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0, label: PCS1, identifier: PCS1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'false'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBootPin:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '17', peripheral: GPIOE, signal: 'GPIO, 14', pin_signal: PTE14/FTM0_FLT1/TRGMUX_OUT4, direction: INPUT, gpio_interrupt: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPin(void)
{

    gpio_pin_config_t SW3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE14 (pin 17)  */
    GPIO_PinInit(BOARD_INITBOOTPIN_SW3_GPIO, BOARD_INITBOOTPIN_SW3_PIN, &SW3_config);

    /* PORTE14 (pin 17) is configured as PTE14 */
    PORT_SetPinMux(BOARD_INITBOOTPIN_SW3_PORT, BOARD_INITBOOTPIN_SW3_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART0_InitPins:
- options: {callFromInitBoot: 'false', prefix: LPUART0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '54', peripheral: LPUART0, signal: RX, pin_signal: TSI1_CH15/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3}
  - {pin_num: '53', peripheral: LPUART0, signal: TX, pin_signal: TSI1_CH16/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART0_InitPins(void)
{

    /* PORTB0 (pin 54) is configured as LPUART0_RX */
    PORT_SetPinMux(LPUART0_RX_PORT, LPUART0_RX_PIN, kPORT_MuxAlt2);

    /* PORTB1 (pin 53) is configured as LPUART0_TX */
    PORT_SetPinMux(LPUART0_TX_PORT, LPUART0_TX_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '53', peripheral: TSI1, signal: 'CH, 16', pin_signal: TSI1_CH16/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0}
  - {pin_num: '54', peripheral: TSI1, signal: 'CH, 15', pin_signal: TSI1_CH15/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART0_RestoreDefault(void)
{

    /* PORTB0 (pin 54) is configured as TSI1_CH15 */
    PORT_SetPinMux(UART0_RESTOREDEFAULT_RX_PORT, UART0_RESTOREDEFAULT_RX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB1 (pin 53) is configured as TSI1_CH16 */
    PORT_SetPinMux(UART0_RESTOREDEFAULT_TX_PORT, UART0_RESTOREDEFAULT_TX_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART0_PollForActivity:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '54', peripheral: LPUART0, signal: RX, pin_signal: TSI1_CH15/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART0_PollForActivity
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART0_PollForActivity(void)
{

    /* PORTB0 (pin 54) is configured as LPUART0_RX */
    PORT_SetPinMux(UART0_POLLFORACTIVITY_RX_PORT, UART0_POLLFORACTIVITY_RX_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C0_InitPins:
- options: {callFromInitBoot: 'false', prefix: LPI2C0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '72', peripheral: LPI2C0, signal: SCL, pin_signal: TSI1_CH5/PTA3/LPI2C0_SCL/EWM_IN/LPUART0_TX}
  - {pin_num: '73', peripheral: LPI2C0, signal: SDA, pin_signal: TSI1_CH4/PTA2/LPI2C0_SDA/EWM_OUT_b/LPUART0_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void I2C0_InitPins(void)
{

    /* PORTA2 (pin 73) is configured as LPI2C0_SDA */
    PORT_SetPinMux(LPI2C0_SDA_PORT, LPI2C0_SDA_PIN, kPORT_MuxAlt3);

    /* PORTA3 (pin 72) is configured as LPI2C0_SCL */
    PORT_SetPinMux(LPI2C0_SCL_PORT, LPI2C0_SCL_PIN, kPORT_MuxAlt3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '72', peripheral: TSI1, signal: 'CH, 5', pin_signal: TSI1_CH5/PTA3/LPI2C0_SCL/EWM_IN/LPUART0_TX}
  - {pin_num: '73', peripheral: TSI1, signal: 'CH, 4', pin_signal: TSI1_CH4/PTA2/LPI2C0_SDA/EWM_OUT_b/LPUART0_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void I2C0_RestoreDefault(void)
{

    /* PORTA2 (pin 73) is configured as TSI1_CH4 */
    PORT_SetPinMux(I2C0_RESTOREDEFAULT_SDA_PORT, I2C0_RESTOREDEFAULT_SDA_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA3 (pin 72) is configured as TSI1_CH5 */
    PORT_SetPinMux(I2C0_RESTOREDEFAULT_SCL_PORT, I2C0_RESTOREDEFAULT_SCL_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI0_InitPins:
- options: {callFromInitBoot: 'false', prefix: LPSPI0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '48', peripheral: LPSPI0, signal: SCK, pin_signal: TSI1_CH17/PTB2/FTM1_CH0/LPSPI0_SCK/TRGMUX_IN3}
  - {pin_num: '47', peripheral: LPSPI0, signal: SIN, pin_signal: TSI1_CH18/PTB3/FTM1_CH1/LPSPI0_SIN/TRGMUX_IN2}
  - {pin_num: '28', peripheral: LPSPI0, signal: SOUT, pin_signal: ADC0_SE5/TSI0_CH24/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1}
  - {pin_num: '27', peripheral: LPSPI0, signal: PCS1_HREQ, pin_signal: ADC0_SE3/TSI0_CH23/PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_InitPins(void)
{

    /* PORTB2 (pin 48) is configured as LPSPI0_SCK */
    PORT_SetPinMux(LPSPI0_SCK_PORT, LPSPI0_SCK_PIN, kPORT_MuxAlt3);

    /* PORTB3 (pin 47) is configured as LPSPI0_SIN */
    PORT_SetPinMux(LPSPI0_SIN_PORT, LPSPI0_SIN_PIN, kPORT_MuxAlt3);

    /* PORTB4 (pin 28) is configured as LPSPI0_SOUT */
    PORT_SetPinMux(LPSPI0_SOUT_PORT, LPSPI0_SOUT_PIN, kPORT_MuxAlt3);

    /* PORTB5 (pin 27) is configured as LPSPI0_PCS1 */
    PORT_SetPinMux(LPSPI0_PCS1_PORT, LPSPI0_PCS1_PIN, kPORT_MuxAlt3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '27', peripheral: ADC0, signal: 'SE, 3', pin_signal: ADC0_SE3/TSI0_CH23/PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0}
  - {pin_num: '28', peripheral: ADC0, signal: 'SE, 5', pin_signal: ADC0_SE5/TSI0_CH24/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1}
  - {pin_num: '47', peripheral: TSI1, signal: 'CH, 18', pin_signal: TSI1_CH18/PTB3/FTM1_CH1/LPSPI0_SIN/TRGMUX_IN2}
  - {pin_num: '48', peripheral: TSI1, signal: 'CH, 17', pin_signal: TSI1_CH17/PTB2/FTM1_CH0/LPSPI0_SCK/TRGMUX_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_RestoreDefault(void)
{

    /* PORTB2 (pin 48) is configured as TSI1_CH17 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SCK_PORT, SPI0_RESTOREDEFAULT_SCK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin 47) is configured as TSI1_CH18 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SIN_PORT, SPI0_RESTOREDEFAULT_SIN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB4 (pin 28) is configured as ADC0_SE5 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SOUT_PORT, SPI0_RESTOREDEFAULT_SOUT_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB5 (pin 27) is configured as ADC0_SE3 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_PCS1_PORT, SPI0_RESTOREDEFAULT_PCS1_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
